a52dec
aalib
accounts-qml-module
accountsservice
acl
acpi
adapta-gtk-theme
adobe-source-code-pro-fonts
adwaita-icon-theme
aha
alacritty
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-tools
android-udev
aom
apache
appstream
appstream-qt
apr
apr-util
arc-gtk-theme
arch-install-scripts
archiso
archlinux-appstream-data
archlinux-keyring
argon2
aria2
ark
at-spi2-core
atkmm
attica
attr
audiofile
audit
autoconf
automake
avahi
baloo
baloo-widgets
base
bash
bash-completion
bat
bc
binutils
bison
blas
bluedevil
bluez
bluez-libs
bluez-qt
bolt
boost-libs
breeze
breeze-gtk
breeze-icons
bridge-utils
brotli
bspwm
btrfs-progs
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
calcurse
cantarell-fonts
capstone
cblas
cdparanoia
cdrtools
chromaprint
chromium
cifs-utils
cmake
cmatrix
code
confuse
connman
convertlit
coreutils
cpio
cronie
cryptsetup
cups
cups-filters
curl
cython
dash
dav1d
db
dbus
dbus-glib
dbus-python
dconf
deepin-community-wallpapers
desktop-file-utils
device-mapper
dhcpcd
diffutils
discount
discover
djvulibre
dkms
dmidecode
dmraid
dnsmasq
dnssec-anchors
dolphin
dosfstools
double-conversion
drkonqi
dstat
dtc
duktape
dunst
e2fsprogs
ebook-tools
editorconfig-core-c
edk2-armvirt
edk2-ovmf
efibootmgr
efivar
electron18
electron19
elfutils
enchant
erofs-utils
exfatprogs
exiv2
exo
expat
faad2
fakeroot
fd
festival
ffmpeg
ffmpegthumbnailer
ffmpegthumbs
fftw
figlet
file
filesystem
findutils
firefox
firefox-ublock-origin
flac
flashrom
flex
fluidsynth
fmt
fontconfig
frameworkintegration
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
fuseiso
fwupd
fwupd-efi
fzf
gawk
gc
gcab
gcc
gcc-libs
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geany
geoclue
geocode-glib
geocode-glib-common
gettext
ghostscript
giflib
girara
git
gjs
glew
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnupg
gnutls
gobject-introspection-runtime
gparted
gpgme
gpm
gptfdisk
graphene
graphicsmagick
graphite
graphviz
grep
groff
grub
grub-customizer
gsettings-desktop-schemas
gsfonts
gsl
gsm
gspell
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtkglext
gtkmm3
gtksourceview3
gtksourceview4
gts
guile
gzip
harfbuzz
hicolor-icon-theme
hidapi
htop
http-parser
hwdata
hwloc
hyphen
i2c-tools
i3-gaps
i3lock
iana-etc
ibus
icu
ijs
imagemagick
imlib2
inetutils
iniparser
inkscape
intel-ucode
iproute2
iptables-nft
iputils
iso-codes
jack2
jansson
jasper
jbig2dec
jemalloc
js102
js78
js91
json-c
json-glib
jsoncpp
kaccounts-integration
kaccounts-providers
kactivities
kactivities-stats
kactivitymanagerd
karchive
kauth
kbd
kbookmarks
kcalc
kcalendarcore
kcmutils
kcodecs
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdeconnect
kdecoration
kded
kdegraphics-mobipocket
kdegraphics-thumbnailers
kdelibs4support
kdeplasma-addons
kdesu
kdialog
kdnssd
kdsoap
kdsoap-ws-discovery-client
kemoticons
kexec-tools
keyutils
kfilemetadata
kgamma5
kglobalaccel
kguiaddons
kholidays
khotkeys
ki18n
kiconthemes
kidletime
kimageannotator
kinfocenter
kio
kio-extras
kio-fuse
kio-gdrive
kirigami2
kitemmodels
kitemviews
kjobwidgets
kjs
kmenuedit
kmod
knewstuff
knotifications
knotifyconfig
konsole
kpackage
kparts
kpeople
kpeoplevcard
kpipewire
kpty
kquickcharts
krb5
krunner
kscreen
kscreenlocker
kservice
ksshaskpass
ksystemstats
ktexteditor
ktextwidgets
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwayland-integration
kwidgetsaddons
kwin
kwindowsystem
kwrited
kxmlgui
l-smash
lame
lapack
latte-dock
layer-shell-qt
lcms2
ldb
ldns
leptonica
less
lib2geom
libaccounts-glib
libaccounts-qt
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libb64
libblockdev
libbluray
libbpf
libbs2b
libbsd
libburn
libbytesize
libcaca
libcacard
libcamera
libcanberra
libcap
libcap-ng
libcbor
libcddb
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcolord
libconfig
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libde265
libdmtx
libdrm
libdv
libdvdnav
libdvdread
libedit
libelf
libepoxy
libev
libevdev
libevent
libexif
libfakekey
libfdk-aac
libffi
libfontenc
libfreeaptx
libftdi
libgcrypt
libgit2
libglvnd
libgme
libgpg-error
libgtop
libgudev
libgusb
libheif
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libindicator-gtk3
libinih
libinput
libinstpatch
libisl
libisoburn
libisofs
libjcat
libjpeg-turbo
libkdcraw
libkexiv2
libkgapi
libksba
libkscreen
libksysguard
libldac
libldap
liblqr
libluv
libmad
libmatekbd
libmatemixer
libmbim
libmd
libmediainfo
libmfx
libmikmod
libmm-glib
libmms
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmtp
libnatpmp
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsl
libogg
libomxil-bellagio
libopenmpt
libosinfo
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient
libqalculate
libqmi
libqrtr-glib
libraqm
libraw
libraw1394
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsidplayfp
libsigc++
libslirp
libsm
libsmbios
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvirt
libvirt-glib
libvirt-python
libvisio
libvisual
libvncserver
libvorbis
libvpx
libvterm
libwacom
libwebp
libwpd
libwpg
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzen
libzip
licenses
lightdm
lilv
linux-api-headers
linux-firmware
linux-firmware-whence
linux-lts
linux-lts-headers
llvm-libs
lm_sensors
lmdb
logrotate
lsof
lua52
lua53
lua53-lgi
luajit
luit
lv2
lvm2
lxappearance
lz4
lzip
lzo
lzop
m4
mailcap
make
man-db
mariadb
mariadb-clients
mariadb-libs
mate-desktop
mate-settings-daemon
mc
md4c
mdadm
media-player-info
mediainfo
meld
memtester
mesa
mesa-utils
milou
miniupnpc
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mlocate
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpc
mpd
mpfr
mpg123
mpv
msgpack-c
mtdev
mtools
mujs
multipath-tools
nano
ncdu
ncmpcpp
ncurses
ndctl
neofetch
neovim
net-tools
netpbm
nettle
networkmanager
networkmanager-qt
nftables
ninja
node-gyp
nodejs
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
ntfs-3g
numactl
oath-toolkit
obsidian
ocl-icd
okular
oniguruma
openal
openbsd-netcat
opencore-amr
openjpeg2
openmpi
openpmix
openssh
openssl
openssl-1.0
opus
orc
os-prober
osinfo-db
oxygen
oxygen-sounds
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
papirus-icon-theme
parted
pass
patch
pciutils
pcre
pcre2
perl
perl-encode-locale
perl-error
perl-file-basedir
perl-file-desktopentry
perl-file-mimeinfo
perl-ipc-system-simple
perl-mailtools
perl-timedate
perl-uri
phodav
phonon-qt5
phonon-qt5-gstreamer
php
php-apache
php-cgi
php-gd
php-imagick
picom
pinentry
pipewire
pipewire-media-session
pixman
pkgconf
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-framework
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-workspace
plasma-workspace-wallpapers
polkit
polkit-kde-agent
polkit-qt5
polybar
poppler
poppler-data
poppler-glib
poppler-qt5
popt
portaudio
potrace
powerdevil
ppp
prison
procps-ng
protobuf
protobuf-c
psmisc
pulseaudio
pulseaudio-alsa
pulseaudio-qt
pulsemixer
purpose
python
python-aiohttp
python-aiosignal
python-appdirs
python-async-timeout
python-attrs
python-autocommand
python-blinker
python-cachecontrol
python-cairo
python-cffi
python-chardet
python-charset-normalizer
python-colorama
python-contextlib2
python-cryptography
python-cssselect
python-distlib
python-distro
python-docopt
python-frozenlist
python-gobject
python-html5lib
python-idna
python-inflect
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-lxml
python-magic
python-more-itertools
python-msgpack
python-multidict
python-natsort
python-nspektr
python-numpy
python-ordered-set
python-packaging
python-pep517
python-pillow
python-pip
python-ply
python-progress
python-psutil
python-pycparser
python-pydantic
python-pyopenssl
python-pyparsing
python-pyxdg
python-requests
python-resolvelib
python-retrying
python-setuptools
python-six
python-toml
python-tomli
python-trove-classifiers
python-typing_extensions
python-urllib3
python-urwid
python-urwidtrees
python-validate-pyproject
python-webencodings
python-wheel
python-xcffib
python-xlib
python-yarl
qca-qt5
qemu-audio-spice
qemu-base
qemu-block-curl
qemu-block-dmg
qemu-block-nfs
qemu-block-ssh
qemu-chardev-spice
qemu-common
qemu-emulators-full
qemu-hw-display-qxl
qemu-hw-display-virtio-gpu
qemu-hw-display-virtio-gpu-gl
qemu-hw-display-virtio-gpu-pci
qemu-hw-display-virtio-gpu-pci-gl
qemu-hw-display-virtio-vga
qemu-hw-display-virtio-vga-gl
qemu-hw-s390x-virtio-gpu-ccw
qemu-hw-usb-host
qemu-hw-usb-redirect
qemu-hw-usb-smartcard
qemu-img
qemu-pr-helper
qemu-system-aarch64
qemu-system-alpha
qemu-system-alpha-firmware
qemu-system-arm
qemu-system-arm-firmware
qemu-system-avr
qemu-system-cris
qemu-system-hppa
qemu-system-hppa-firmware
qemu-system-loongarch64
qemu-system-m68k
qemu-system-microblaze
qemu-system-microblaze-firmware
qemu-system-mips
qemu-system-nios2
qemu-system-or1k
qemu-system-ppc
qemu-system-ppc-firmware
qemu-system-riscv
qemu-system-riscv-firmware
qemu-system-rx
qemu-system-s390x
qemu-system-s390x-firmware
qemu-system-sh4
qemu-system-sparc
qemu-system-sparc-firmware
qemu-system-tricore
qemu-system-x86
qemu-system-x86-firmware
qemu-system-xtensa
qemu-tools
qemu-ui-curses
qemu-ui-opengl
qemu-ui-spice-app
qemu-ui-spice-core
qemu-user
qemu-virtiofsd
qpdf
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-webkit
qt5-webview
qt5-x11extras
ragel
ranger
rav1e
rclone
re2
readline
redshift
reflector
rest
rhash
ripgrep
rofi
rsync
rtkit
rubberband
rubiks
run-parts
rust
rxvt-unicode-terminfo
s-tui
sbc
scrot
sddm
sddm-kcm
sdl12-compat
sdl2
seabios
sed
semver
serd
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
slop
smartmontools
smbclient
smplayer
snappy
socat
solid
sonnet
sord
sound-theme-freedesktop
source-highlight
spectacle
speex
speexdsp
spice
spice-gtk
spirv-tools
sqlite
squashfs-tools
sratom
srt
sshfs
starship
startup-notification
stress
sudo
svt-av1
sxhkd
sxiv
syndication
syntax-highlighting
sysfsutils
sysstat
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
task
taskwarrior-tui
tdb
terminus-font
tesseract
tesseract-data-eng
tesseract-data-osd
tevent
texinfo
thin-provisioning-tools
threadweaver
thunar
tinyxml2
tmux
tpm2-tss
tracker3
transcode
transmission-cli
transmission-gtk
trash-cli
tree
tree-sitter
tslib
ttf-font-awesome
ttf-hack
ttf-hannom
ttf-jetbrains-mono
ttf-joypixels
ttf-liberation
twolame
tzdata
uchardet
udisks2
ueberzug
unclutter
unibilium
unrar
unzip
upower
usbmuxd
usbredir
usbutils
util-linux
util-linux-libs
v4l-utils
vde2
vid.stab
vim
vim-runtime
virglrenderer
virt-install
virt-manager
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-tools
wavpack
wayland
wayland-protocols
wayland-utils
webrtc-audio-processing
wget
which
wildmidi
woff2
wolfssl
wpa_supplicant
x11vnc
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xdo
xdotool
xf86-input-libinput
xf86-video-intel
xfconf
xfsprogs
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-util-macros
xorg-xauth
xorg-xdpyinfo
xorg-xev
xorg-xinit
xorg-xkbcomp
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorgproto
xsel
xterm
xvidcore
xwallpaper
xxhash
xz
yajl
youtube-dl
zathura
zathura-djvu
zathura-pdf-poppler
zathura-ps
zeromq
zimg
zip
zita-alsa-pcmi
zita-resampler
zlib
zsh
zsh-autosuggestions
zsh-syntax-highlighting
zstd
zxing-cpp
zziplib
