acl
acpi
adapta-gtk-theme
adobe-source-code-pro-fonts
adwaita-icon-theme
alacritty
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-tools
android-udev
aom
apache
apr
apr-util
arc-gtk-theme
arch-install-scripts
archiso
archlinux-keyring
argon2
aria2
at-spi2-atk
at-spi2-core
atk
atkmm
attr
audit
autoconf
automake
avahi
base
bash
bash-completion
bat
bc
binutils
bison
bluez-libs
boost-libs
breeze-icons
brotli
bspwm
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
calcurse
cantarell-fonts
celt
cmatrix
connman
coreutils
cryptsetup
curl
dash
dav1d
db
dbus
dbus-glib
dbus-python
dconf
deepin-community-wallpapers
desktop-file-utils
device-mapper
dhcpcd
diffutils
djvulibre
dkms
dnssec-anchors
dosfstools
double-conversion
dstat
dunst
e2fsprogs
efibootmgr
efivar
elfutils
exo
expat
fakeroot
ffmpeg
ffmpegthumbnailer
fftw
figlet
file
filesystem
findutils
firefox
flac
flex
fontconfig
freetype2
fribidi
fuse-common
fuse2
fuseiso
fzf
galculator-gtk2
gawk
gc
gcc
gcc-libs
gd
gdbm
gdk-pixbuf2
geany
geoclue
geocode-glib
gettext
ghostscript
giflib
girara
git
gjs
glew
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnupg
gnutls
gobject-introspection-runtime
gpgme
gpm
graphite
grep
groff
grub
gsettings-desktop-schemas
gsm
gtk-update-icon-cache
gtk2
gtk3
gtkglext
gtkmm3
gtksourceview3
guile
gzip
harfbuzz
hicolor-icon-theme
hidapi
htop
http-parser
hwids
hwloc
i2c-tools
i3-gaps
i3lock
iana-etc
ibus
icu
ijs
imagemagick
imlib2
inetutils
intel-ucode
iproute2
iptables
iputils
iso-codes
jack2
jansson
jbig2dec
jemalloc
js78
json-c
json-glib
jsoncpp
kbd
kbfs
kexec-tools
keybase
keyutils
kmod
krb5
l-smash
lame
lcms2
ldns
less
libaio
libarchive
libass
libassuan
libasyncns
libavc1394
libavif
libbluray
libburn
libcaca
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libconfig
libcroco
libcups
libdaemon
libdatrie
libde265
libdrm
libdvdnav
libdvdread
libedit
libelf
libepoxy
libev
libevdev
libevent
libexif
libffi
libfontenc
libgcrypt
libgit2
libglvnd
libgpg-error
libgtop
libgudev
libheif
libibus
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libinput
libisoburn
libisofs
libjpeg-turbo
libksba
libldap
liblqr
libluv
libmatekbd
libmatemixer
libmediainfo
libmfx
libmm-glib
libmms
libmnl
libmodplug
libmpc
libmpdclient
libmtp
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsl
libogg
libomxil-bellagio
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libpng
libproxy
libpsl
libpulse
libraqm
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsm
libsndfile
libsodium
libsoup
libsoxr
libspectre
libssh
libssh2
libsynctex
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtool
libunistring
libunwind
libusb
libutempter
libuv
libva
libvdpau
libvncserver
libvorbis
libvpx
libvterm
libwacom
libwebp
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyuv
libzen
libzip
licenses
lightdm
linux-api-headers
linux-firmware
linux-lts
linux-lts-headers
llvm-libs
lm_sensors
lsof
lua52
lua53
lua53-lgi
luajit
luit
lxappearance
lz4
lzo
m4
mailcap
make
man-db
mariadb
mariadb-clients
mariadb-libs
mate-desktop
mate-settings-daemon
mc
md4c
mediainfo
meld
mesa
minizip
mkinitcpio
mkinitcpio-busybox
mlocate
mobile-broadband-provider-info
mpc
mpfr
mpv
msgpack-c
mtdev
mtools
mujs
nano
ncdu
ncurses
neofetch
neovim
nettle
networkmanager
ninja
node-gyp
nodejs
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
ntfs-3g
oath-toolkit
oniguruma
opencore-amr
openjpeg2
openmpi
openssh
openssl
opus
orc
os-prober
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
papirus-icon-theme
parted
pass
patch
pciutils
pcre
pcre2
perl
perl-encode-locale
perl-error
perl-file-basedir
perl-file-desktopentry
perl-file-mimeinfo
perl-ipc-system-simple
perl-mailtools
perl-timedate
perl-uri
php
php-apache
php-cgi
php-gd
php-imagick
picom
pinentry
pixman
pkgconf
polkit
poppler
poppler-glib
popt
procps-ng
protobuf
psmisc
pulseaudio
pulseaudio-alsa
pulsemixer
python
python-aiohttp
python-appdirs
python-async-timeout
python-attrs
python-blinker
python-cachecontrol
python-cairo
python-cairocffi
python-cffi
python-chardet
python-colorama
python-contextlib2
python-cryptography
python-distlib
python-distro
python-docopt
python-gobject
python-html5lib
python-idna
python-magic
python-more-itertools
python-msgpack
python-multidict
python-natsort
python-ordered-set
python-packaging
python-pep517
python-pillow
python-pip
python-ply
python-progress
python-psutil
python-pycparser
python-pyopenssl
python-pyparsing
python-pyxdg
python-requests
python-resolvelib
python-retrying
python-setuptools
python-shiboken2
python-six
python-toml
python-tomli
python-typing_extensions
python-urllib3
python-urwid
python-urwidtrees
python-webencodings
python-xcffib
python-xlib
python-yarl
qrencode
qt5-base
qt5-declarative
qt5-x11extras
rav1e
readline
redshift
reflector
rest
rofi
rtkit
rubberband
run-parts
rxvt-unicode-terminfo
s-tui
scrot
sddm
sdl
sdl2
sed
semver
shaderc
shadow
shared-mime-info
slang
slop
sound-theme-freedesktop
speex
speexdsp
spirv-tools
sqlite
squashfs-tools
srt
starship
startup-notification
stress
sudo
svt-av1
sxhkd
sxiv
sysfsutils
sysstat
systemd
systemd-libs
systemd-sysvcompat
tar
task
taskwarrior-tui
tdb
terminus-font
texinfo
thunar
tinyxml2
tmux
transmission-cli
trash-cli
tree
tree-sitter
tslib
ttf-font-awesome
ttf-joypixels
ttf-liberation
tzdata
uchardet
ueberzug
unclutter
unibilium
unrar
unzip
usbutils
util-linux
util-linux-libs
v4l-utils
vid.stab
vim
vim-runtime
virtualbox
virtualbox-guest-iso
virtualbox-host-dkms
vmaf
vulkan-icd-loader
wayland
wayland-protocols
webrtc-audio-processing
wget
which
wpa_supplicant
x11vnc
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-user-dirs
xdg-utils
xdo
xf86-input-libinput
xf86-video-intel
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-util-macros
xorg-xauth
xorg-xdpyinfo
xorg-xev
xorg-xinit
xorg-xkbcomp
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorgproto
xsel
xterm
xvidcore
xwallpaper
xz
yajl
youtube-dl
zathura
zathura-djvu
zathura-pdf-poppler
zathura-ps
zeromq
zimg
zita-alsa-pcmi
zita-resampler
zlib
zsh
zsh-autosuggestions
zsh-syntax-highlighting
zstd
